# Data Cleaning and Preparation

In [1]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)

In [2]:
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Handling Missing Data

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [6]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.204708  0.478943 -0.519439
1 -0.555730  1.965781  1.393406
2  0.092908  0.281746  0.769023
3  1.246435  1.007189 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [14]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [15]:
df.dropna()

          0         1         2
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [16]:
df.dropna(thresh=2)

          0         1         2
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

### Filling In Missing Data

In [17]:
df.fillna(0)

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [18]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.204708  0.500000  0.000000
1 -0.555730  0.500000  0.000000
2  0.092908  0.500000  0.769023
3  1.246435  0.500000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [19]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [20]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.000940  1.343810
3 -0.713544 -0.831154 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512

In [21]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761       NaN       NaN
5 -1.265934       NaN       NaN

In [22]:
df.fillna(method='ffill')

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761  0.124121 -2.370232
5 -1.265934  0.124121 -2.370232

In [23]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761       NaN -2.370232
5 -1.265934       NaN -2.370232

In [24]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates

In [25]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [29]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [30]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [31]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [32]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [33]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [34]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [35]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [36]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [37]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [38]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [39]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [40]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [41]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [42]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [43]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [44]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [45]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [46]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [47]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [48]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [49]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [50]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [51]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [52]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [53]:
data = np.random.rand(20)
data

array([0.4896, 0.3773, 0.8486, 0.9111, 0.3838, 0.3155, 0.5684, 0.1878,
       0.1258, 0.6876, 0.7996, 0.5735, 0.9732, 0.6341, 0.8884, 0.4954,
       0.3516, 0.7142, 0.5039, 0.2256])

In [54]:
pd.cut(data, 4, precision=2)

[(0.34, 0.55], (0.34, 0.55], (0.76, 0.97], (0.76, 0.97], (0.34, 0.55], ..., (0.34, 0.55], (0.34, 0.55], (0.55, 0.76], (0.34, 0.55], (0.12, 0.34]]
Length: 20
Categories (4, interval[float64]): [(0.12, 0.34] < (0.34, 0.55] < (0.55, 0.76] < (0.76, 0.97]]

In [55]:
data = np.random.randn(1000)  # Normally distributed
data

array([ 0.3329,  0.7584, -0.6605,  0.8626, -0.01  ,  0.05  ,  0.6702,
        0.853 , -0.9559, -0.0235, -2.3042, -0.6525, -1.2183, -1.3326,
        1.0746,  0.7236,  0.69  ,  1.0015, -0.5031, -0.6223, -0.9212,
       -0.7262,  0.2229,  0.0513, -1.1577,  0.8167,  0.4336,  1.0107,
        1.8249, -0.9975,  0.8506, -0.1316,  0.9124,  0.1882,  2.1695,
       -0.1149,  2.0037,  0.0296,  0.7953,  0.1181, -0.7485,  0.585 ,
        0.1527, -1.5657, -0.5625, -0.0327, -0.929 , -0.4826, -0.0363,
        1.0954,  0.9809, -0.5895,  1.5817, -0.5287,  0.457 ,  0.93  ,
       -1.5693, -1.0225, -0.4028,  0.2205, -0.1934,  0.6692, -1.649 ,
       -2.2528, -1.1668,  0.3536,  0.7021, -0.2746, -0.1391,  0.1077,
       -0.6065, -0.4171, -0.017 , -1.2241, -1.8008,  1.6347,  0.989 ,
        0.4579,  0.5552,  1.3067, -0.4406, -0.3014,  0.4988, -0.824 ,
        1.3206,  0.508 , -0.6534,  0.187 , -0.3917, -0.2723, -0.0171,
        0.6803,  0.6355, -0.7572,  0.7181, -0.3043, -1.6778,  0.427 ,
       -1.5637, -0.3675,  1.0459,  1.22  , -0.2477, -0.4162, -0.1167,
       -1.8448,  2.0687, -0.777 ,  1.4402, -0.1106,  1.2274,  1.9208,
        0.7464,  2.2247, -0.6794,  0.7274, -0.8687, -1.2139, -0.4706,
       -0.9192, -0.8388,  0.4352, -0.5578, -0.5675, -0.3726, -0.9266,
        1.7551,  1.2098,  1.27  , -0.9744, -0.6347, -0.3957, -0.2894,
       -0.7343, -0.7285,  0.8388,  0.2669,  0.7212,  0.911 , -1.0209,
       -1.4134,  1.2966,  0.2523,  1.1275, -0.5684,  0.3094, -0.5774,
       -1.1686, -0.825 , -2.6444, -0.153 , -0.7519, -0.1326,  1.4573,
        0.6095, -0.4938,  1.24  , -0.1357,  1.43  , -0.8469,  0.6033,
        1.2636, -0.2555, -0.4457,  0.4684, -0.9616, -1.8245,  0.6254,
        1.0229,  1.1074,  0.0909, -0.3501,  0.218 , -0.8948, -1.7415,
       -1.0523,  1.4366, -0.5762, -2.4203, -1.0623,  0.2374,  0.001 ,
        0.0653, -1.3675, -0.0303,  0.9405, -0.6424,  1.0402, -1.0829,
        0.4292, -0.2362,  0.6418, -0.3317,  1.3941, -1.0767, -0.1925,
       -0.8712,  0.4209, -1.2114, -0.2589, -0.5816, -1.2604,  0.4646,
       -1.0702,  0.8042, -0.1567,  2.0104, -0.8871, -0.9779, -0.2672,
        0.4833, -0.4003,  0.4499,  0.3996, -0.1516, -2.5579,  0.1608,
        0.0765, -0.2972, -1.2943, -0.8852, -0.1875, -0.4936, -0.1154,
       -0.3507,  0.0447, -0.8978,  0.8909, -1.1512, -2.6123,  1.1413,
       -0.8671,  0.3836, -0.437 ,  0.3475, -1.2302,  0.5711,  0.0601,
       -0.2255,  1.3497,  1.3503, -0.3867,  0.866 ,  1.7472, -1.4102,
       -0.3782, -0.3458,  0.3801,  0.189 ,  1.3233, -2.2646, -0.915 ,
       -0.479 ,  1.0472,  0.9239, -0.1142,  0.4058,  0.2885, -0.4348,
        0.3588, -0.3882,  2.1287,  1.4096, -0.1054,  0.7004,  2.0929,
       -0.137 , -0.9305,  0.3275,  1.303 , -1.4094, -0.1441, -0.7164,
        0.1036, -1.4957, -1.1749,  2.614 , -0.6893, -0.7517,  0.6363,
       -1.1576,  0.6147,  1.0214,  0.6683, -0.8095, -0.9081,  1.5123,
        0.0951,  1.1847,  0.637 , -0.5393, -0.0551, -1.1359, -0.1705,
       -1.1581,  1.1046,  0.6342,  1.2597,  0.9649, -0.4344, -0.8796,
       -0.6948,  1.2264,  0.4573,  0.1157,  1.014 , -1.135 , -0.2634,
        1.3064, -1.6108, -1.0266,  1.2416, -0.1568, -2.4491, -1.0339,
        1.5995,  0.4741,  0.1513, -0.5422, -0.4755,  0.1064, -1.3082,
        2.1732,  0.5646, -0.1905, -0.9169, -0.9758,  2.2123,  0.0739,
        1.8186, -1.5815, -0.7744,  0.5529,  0.1061,  3.9275, -0.2551,
        0.8541, -0.3648,  0.1311, -0.6976,  1.3356, -0.151 ,  0.4429,
        0.9416,  0.5334,  0.3563, -0.0101,  1.4158,  0.5661,  0.4565,
        0.1948, -0.6551, -0.5652,  3.1769,  0.9595, -0.9753, -1.1167,
       -1.1044, -0.8988, -1.3666,  0.4514, -1.5872, -0.7328, -0.5146,
       -0.6119, -0.0316,  0.2341,  0.2719,  1.2308,  1.2883,  0.8518,
       -1.5292, -1.5517,  0.2973,  0.3448, -0.3981,  0.4294, -0.2859,
       -2.2284,  0.0666,  0.49  ,  1.8679,  2.0704, -0.2454,  0.7623,
        0.129 ,  0.6271, -1.0622, -1.4995,  0.5452,  0.4008, -1.9462,
        0.505 , -0.9105, -0.2197,  0.4081, -0.6031, -0.3611,  0.564 ,
       -1.0566,  1.392 , -1.7613, -0.9116,  0.6583, -1.5795,  0.4577,
       -0.1833, -0.6855,  0.1064, -0.3182,  0.4337,  0.5718,  0.5671,
        0.0816, -0.3023, -0.7269,  0.1803, -0.5202,  0.3981, -0.9169,
       -0.0827, -1.9397,  1.408 ,  1.5124,  0.5265, -0.2669,  0.8623,
        0.0838, -1.8723, -0.9628,  0.0801,  0.1287, -0.4791, -0.6403,
        0.746 , -0.6225,  0.9363,  0.75  , -0.0567,  2.3007,  0.5695,
        1.4894,  1.2643, -0.7618, -0.3316, -1.7513,  0.6289,  0.2825,
       -1.3381, -0.5006,  0.1216,  1.7083, -0.971 , -0.6193, -0.7267,
        1.2217,  0.5037, -1.3879,  0.2049,  0.6037,  0.5457,  0.2355,
        0.1118, -1.2515, -2.9493,  0.6346,  0.1242,  1.2976, -1.6869,
        1.0895,  2.0609, -0.2412, -0.9479,  0.6763, -0.6534, -0.6523,
        0.5288,  0.3578,  0.1886,  0.8694, -0.0507, -0.7164, -0.1033,
       -1.141 , -0.5008, -0.3893, -0.4739,  0.1287,  0.1537,  0.4448,
        0.1285,  0.2525, -0.9406,  1.0021, -0.5254, -0.8874,  1.8313,
       -0.923 ,  0.7005, -0.8922,  2.3007, -0.8178,  0.5138,  0.6236,
        1.4892,  1.9405,  0.5432,  0.5062,  1.662 , -1.1892,  0.0936,
       -0.5392, -1.4374,  0.1879, -0.4505, -0.5169, -0.0956,  0.3164,
        0.6033, -1.4946, -0.1109,  0.2413, -0.5826, -0.2411,  0.2364,
        0.1247,  1.0463, -0.2731, -0.5348, -0.3066, -0.1622, -1.0832,
        0.7084,  1.5207,  0.2903, -0.6831, -0.9503,  0.4007, -0.1261,
        0.3982,  0.1416, -0.2641, -0.4522,  0.7582, -0.5156, -0.5912,
        0.8967, -0.9714,  1.8408,  0.1539, -0.2741, -1.7849,  0.981 ,
       -0.8737, -1.0156, -0.4112,  1.4656, -1.0062, -0.9021,  0.7528,
       -0.4905, -0.5247, -0.6992,  0.3524,  0.0681, -0.9303,  0.8454,
        0.0165,  0.845 ,  1.8508,  0.0221, -1.3692,  0.8872,  0.0143,
       -0.0742, -0.0486,  1.235 , -0.4333,  1.391 ,  0.8202, -0.2474,
        0.3023,  0.544 , -0.9424, -1.2664,  0.9372, -0.7201, -1.594 ,
       -0.3755, -0.9587,  0.7943, -1.6051,  0.5437,  0.9252, -1.4696,
       -0.3996,  1.4173, -0.8976,  1.8448,  1.2532, -1.4909, -0.0277,
        1.3752, -0.0252, -0.6679, -2.868 ,  0.2107,  1.2872, -0.5743,
        0.4953,  0.396 ,  0.5888, -1.2818,  2.0299, -0.5019, -0.1593,
       -1.4962,  0.0114,  0.4194,  2.0512, -0.3688, -1.6893,  0.1477,
       -0.181 ,  0.1581, -0.3966, -0.4002, -0.8249, -0.2444,  1.2195,
       -0.4336,  0.8612, -0.3345,  0.1596, -0.9842,  0.7541, -0.2844,
        0.3248, -0.8854, -1.2809,  0.1961,  0.9546, -0.801 ,  0.0159,
        1.0876, -0.6312, -0.0227,  0.6859,  0.5192,  0.1827,  0.2046,
       -0.266 , -0.0002,  1.2395, -0.8197, -0.2604,  0.5191,  0.1431,
       -0.1167,  1.4967, -1.4843, -1.6712,  0.9172, -0.758 ,  2.0648,
       -0.8508,  0.4995, -0.0793, -1.4033,  1.5789,  0.0004,  0.9009,
       -0.4549, -0.8645,  1.1291,  0.0579, -0.4337,  0.0927, -1.3978,
        1.4578, -0.1768, -0.2542, -1.2634,  0.4523, -0.8401, -0.5027,
        0.5134,  1.6417,  0.5808, -1.7073, -0.1784, -0.8285,  1.2863,
       -0.4065,  0.1566,  0.0521,  0.9558,  0.7432, -0.4863,  1.9205,
       -0.6527, -0.1733, -0.3604, -0.3804, -1.2981,  0.5279, -0.0931,
        0.4012, -0.1026,  0.0309,  2.6161, -0.7856, -0.507 , -2.0182,
       -0.6769,  2.6667,  1.4515,  0.6346, -0.5028,  0.5129,  1.7568,
       -0.9743,  0.6804,  0.9558,  1.5015, -0.7563,  0.4735,  1.7137,
       -1.1477,  0.0029, -1.1006, -0.2975,  0.5024, -0.001 , -0.6746,
        0.298 ,  1.4656, -0.3036, -0.9945,  0.1899, -1.684 , -0.4584,
        0.5434, -1.1873, -0.4126,  1.1771, -0.3137,  1.579 ,  0.3754,
       -1.5681, -0.9009,  0.6523,  0.8716,  0.2682,  0.9477,  0.1473,
       -1.7725,  0.5924,  0.0903,  0.6511, -0.0812,  0.8019,  0.1398,
       -0.501 , -0.1283,  0.4146,  0.6046,  2.1341,  0.9412, -0.9315,
       -0.1247,  0.2007,  0.1803, -0.3204, -1.5961, -1.2817,  1.5026,
        0.6535, -0.3195,  0.9551,  0.262 ,  0.1608, -0.5717,  0.3517,
        1.115 ,  1.1833,  1.0609,  0.5107, -0.9388, -0.5465,  0.59  ,
        1.4822,  0.1021,  0.2654,  0.0032, -2.595 , -1.5556,  1.103 ,
        0.5547, -1.289 ,  0.3852, -1.7173, -1.0184,  0.0516,  0.5033,
       -0.5432, -0.5067,  0.7297,  0.4343, -1.1337,  1.424 ,  0.2664,
       -0.8543, -0.5506, -0.6191,  1.0389, -0.9106,  0.53  , -0.0085,
       -1.129 ,  0.5699, -0.8634, -1.3561, -0.0572, -0.1086,  1.6524,
       -1.3509, -0.5461,  0.9914,  2.201 ,  0.4279,  0.2905,  0.612 ,
       -0.5125, -0.7242,  1.6929, -0.2993,  1.5717,  0.4614, -0.6738,
       -1.141 , -1.2289, -1.1593, -0.3208,  1.0883, -0.9062, -0.4642,
       -0.5134,  1.6178, -0.8167,  0.2447, -1.3111,  0.3884,  1.5924,
        0.8704,  0.3352,  0.649 , -0.1832,  0.5002,  1.3688,  0.8951,
        0.6473, -0.5679, -0.5795, -0.7514,  1.0755, -0.6211,  1.8786,
        1.2602,  0.3101,  0.1064,  0.248 , -1.3938, -0.6694, -0.5668,
       -0.3818, -0.9465, -1.0651, -1.3318, -0.9865, -0.3784,  0.7647,
        0.0604,  0.6185, -0.4849, -0.2805,  0.407 ,  1.0252,  0.2548,
        0.0875,  0.0707, -0.5732,  1.2289, -0.9622,  1.5256,  0.8273,
        0.9125, -0.1273,  0.6343, -1.5309, -1.2907, -0.5262, -1.1322,
       -0.4998, -0.7285, -0.5831,  0.3293, -0.8269, -0.5369, -0.563 ,
        0.9184, -0.0794, -0.2786, -0.1305, -1.397 , -0.2447,  0.8303,
        0.2408, -0.9157, -2.2253, -0.6631, -0.3212,  0.4984,  0.3803,
       -1.067 ,  0.2555,  2.1113, -0.6342,  1.3688, -0.9706,  0.6542,
       -1.1719, -0.0032, -0.7456,  1.5983, -0.9134,  2.4029, -0.5894,
        0.1077, -0.1393, -1.1599,  0.619 ,  1.3739, -0.9835,  0.9309,
       -0.8117, -1.8302, -0.1387,  0.3341,  0.4887, -0.1781,  2.1223,
        0.0612,  0.8841, -0.6085, -0.0721,  0.5441,  0.3239, -1.6833,
        0.5269,  1.8588, -0.5484, -0.2794, -0.0213, -0.288 ,  0.0892,
        0.5229,  0.5728, -1.7604,  1.1282,  1.5686, -0.3423, -0.0098,
        0.0531, -0.0419, -1.6943, -0.3624,  1.1275,  2.1838, -1.1866,
        0.3343, -1.0284, -0.1685, -0.9989, -1.5312, -1.0791, -1.0977,
        0.4051, -0.2272, -1.4428, -1.4226, -1.1232,  0.2162, -0.4598,
        0.3334, -0.2547, -0.4483, -1.2613,  1.1651, -0.6212])

In [56]:
cats = pd.qcut(data, 4)  # Cut into quartiles
cats

[(-0.0265, 0.62], (0.62, 3.928], (-0.68, -0.0265], (0.62, 3.928], (-0.0265, 0.62], ..., (-0.68, -0.0265], (-0.68, -0.0265], (-2.9499999999999997, -0.68], (0.62, 3.928], (-0.68, -0.0265]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -0.68] < (-0.68, -0.0265] < (-0.0265, 0.62] < (0.62, 3.928]]

In [57]:
pd.value_counts(cats)

(0.62, 3.928]                   250
(-0.0265, 0.62]                 250
(-0.68, -0.0265]                250
(-2.9499999999999997, -0.68]    250
dtype: int64

In [58]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0265, 1.286], (-0.0265, 1.286], (-1.187, -0.0265], (-0.0265, 1.286], (-0.0265, 1.286], ..., (-1.187, -0.0265], (-1.187, -0.0265], (-2.9499999999999997, -1.187], (-0.0265, 1.286], (-1.187, -0.0265]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -1.187] < (-1.187, -0.0265] < (-0.0265, 1.286] < (1.286, 3.928]]

### Detecting and Filtering Outliers

In [59]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.049091     0.026112    -0.002544    -0.051827
std       0.996947     1.007458     0.995232     0.998311
min      -3.645860    -3.184377    -3.745356    -3.428254
25%      -0.599807    -0.612162    -0.687373    -0.747478
50%       0.047101    -0.013609    -0.022158    -0.088274
75%       0.756646     0.695298     0.699046     0.623331
max       2.653656     3.525865     2.735527     3.366626

In [60]:
col = data[2]
col[np.abs(col) > 3]

41    -3.399312
136   -3.745356
Name: 2, dtype: float64

In [61]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
41   0.457246 -0.025907 -3.399312 -0.974657
60   1.951312  3.260383  0.963301  1.201206
136  0.508391 -0.196713 -3.745356 -1.520113
235 -0.242459 -3.056990  1.918403 -0.578828
258  0.682841  0.326045  0.425384 -3.428254
322  1.179227 -3.184377  1.369891 -1.074833
544 -3.548824  1.553205 -2.186301  1.277104
635 -0.578093  0.193299  1.397822  3.366626
782 -0.207434  3.525865  0.283070  0.544635
803 -3.645860  0.255475 -0.549574 -1.907459

In [62]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.050286     0.025567    -0.001399    -0.051765
std       0.992920     1.004214     0.991414     0.995761
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.599807    -0.612162    -0.687373    -0.747478
50%       0.047101    -0.013609    -0.022158    -0.088274
75%       0.756646     0.695298     0.699046     0.623331
max       2.653656     3.000000     2.735527     3.000000

In [63]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0 -1.0  1.0 -1.0
2  1.0  1.0  1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4 -1.0  1.0 -1.0 -1.0

### Permutation and Random Sampling

In [64]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([3, 1, 4, 2, 0])

In [65]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [66]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3

In [67]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11

In [68]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

4    4
1    7
4    4
2   -1
0    5
3    6
1    7
4    4
0    5
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [69]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [70]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [71]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [72]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [73]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [74]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
6,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
7,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
8,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
9,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3873,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3874,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3875,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3876,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3877,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [75]:
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [76]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [77]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [78]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
                                ...
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, Length: 21, dtype: object

In [79]:
np.random.seed(12345)

In [80]:
values = np.random.rand(10)
values

array([0.9296, 0.3164, 0.1839, 0.2046, 0.5677, 0.5955, 0.9645, 0.6532,
       0.7489, 0.6536])

In [81]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String Manipulation

### String Object Methods

In [82]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [83]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [84]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [85]:
'::'.join(pieces)

'a::b::guido'

In [86]:
'guido' in val

True

In [87]:
val.index(',')

1

In [88]:
val.find(':')

-1

In [89]:
val.index(':')

ValueError: substring not found

In [90]:
val.count(',')

2

In [91]:
val.replace(',', '::')

'a::b::  guido'

In [92]:
val.replace(',', '')

'ab  guido'

### Regular Expressions

In [93]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [94]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [95]:
regex.findall(text)

['    ', '\t ', '  \t']

In [96]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [97]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [98]:
m = regex.search(text)
m

In [99]:
text[m.start():m.end()]

'dave@google.com'

In [100]:
print(regex.match(text))

None

In [101]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [102]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [103]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [104]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [105]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [106]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [107]:
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [108]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [109]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [110]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Rob        [(rob, gmail, com)]
Steve    [(steve, gmail, com)]
Wes                        NaN
dtype: object

In [111]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Rob      True
Steve    True
Wes       NaN
dtype: object

In [112]:
matches.str.get(1)

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

In [113]:
matches.str[0]

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

In [114]:
data.str[:5]

Dave     dave@
Rob      rob@g
Steve    steve
Wes        NaN
dtype: object

In [115]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

## Conclusion